#include "PCF8523.h"
#include "hal_iic.h"


tPCF8523_Reg PCF8523_Reg;

/**********************************************************************************************************************
 *                                                 内部宏                                                              *
 *********************************************************************************************************************/	
#define		PCF8523_WRITE				0xD0
#define		PCF8523_READ				0xD1

#define BIN2BCD(a)			((((a) / 10) << 4) + ((a) % 10))
#define BCD2BIN(a)			(((a) & 0x0F) + ((a) >> 4) * 10)

/**********************************************************************************************************************
 *                                                 局部函数原型                                                       *
 *********************************************************************************************************************/


/**********************************************************************************************************************
 *                                                 全局函数实现                                                       *
 *********************************************************************************************************************/


/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-19
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_WriteData
 * *     >参    数  :外设编号、写地址、写数据指针、长度
 * *     >返 回 值  :IIC_ErrType
 * *     >描    述  :往寄存器写数据
 * *
 * *****************************************************************************/
IIC_ErrType PCF8523_WriteData(IIC_IndexType pcf8523_index,uint8_t addr,uint8_t *data,uint8_t len)
{
    uint8_t i = 0;
    IIC_ErrType state = IIC_ERR_OK;
	
    IIC_SendStart(pcf8523_index);     
    IIC_WriteByte(pcf8523_index,PCF8523_WRITE); 
    state |= IIC_WaitAck(pcf8523_index);   
    IIC_WriteByte(pcf8523_index,addr); 
    state |= IIC_WaitAck(pcf8523_index); 
    for(i = 0;i < len; i++)
    {
        IIC_WriteByte(pcf8523_index,*data++);
        state |= IIC_WaitAck(pcf8523_index); 
    }      
    IIC_SendStop(pcf8523_index);  
    return state;
}




/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-19
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_ReadData
 * *     >参    数  :外设编号、读地址、读数据指针、长度
 * *     >返 回 值  :IIC_ErrType
 * *     >描    述  :读寄存器数据
 * *
 * *****************************************************************************/
IIC_ErrType PCF8523_ReadData(IIC_IndexType pcf8523_index,uint8_t addr,uint8_t *data,uint8_t len)
{
    uint8_t i;
    IIC_ErrType state = IIC_ERR_OK;
  
    IIC_SendStart(pcf8523_index); 
    IIC_WriteByte(pcf8523_index,PCF8523_WRITE);
    state |= IIC_WaitAck(pcf8523_index);   
    IIC_WriteByte(pcf8523_index,addr); 
    state |= IIC_WaitAck(pcf8523_index); 
  
    IIC_SendStart(pcf8523_index); 
    IIC_WriteByte(pcf8523_index,PCF8523_READ); 
    state |= IIC_WaitAck(pcf8523_index);
    for(i = 0;i < len-1; i++)
    {
        *data++ = IIC_ReadByte(pcf8523_index);
        IIC_Ack(pcf8523_index); 
    }
    *data++ = IIC_ReadByte(pcf8523_index);
    IIC_NAck(pcf8523_index);
    IIC_SendStop(pcf8523_index); 
    return state;
}


/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Read_Time
 * *     >参    数  :时间结构体指针
 * *     >返 回 值  :bool
 * *     >描    述  :读时间
 * *
 * *****************************************************************************/
bool PCF8523_Read_Time(tSysTime *time)
{
	uint8_t temp[7] = {0};

	if(IIC_ERR_OK == PCF8523_ReadData(IIC_RTC, PCF8523_Reg_Sec, temp, sizeof(temp)))
	{
		time->Sec   = BCD2BIN(temp[0] & 0x7f);
		time->Min   = BCD2BIN(temp[1] & 0x7f);
		time->Hour  = BCD2BIN(temp[2] & 0x3f);
		time->Day   = BCD2BIN(temp[3] & 0x3f);
		time->Week  = BCD2BIN(temp[4] & 0x07);
		time->Month = BCD2BIN(temp[5] & 0x1f);
		time->Year  = BCD2BIN(temp[6] & 0xff);

		return true;
	}
	
	return false;
}

/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Write_Time
 * *     >参    数  :时间结构体指针
 * *     >返 回 值  :bool
 * *     >描    述  :设置时钟芯片的时间
 * *
 * *****************************************************************************/
bool PCF8523_Write_Time(tSysTime *time)
{
	uint8_t temp[7] = {0};

	temp[0] = BIN2BCD(time->Sec);
	temp[1] = BIN2BCD(time->Min);
	temp[2] = BIN2BCD(time->Hour);
	temp[3] = BIN2BCD(time->Day);
	temp[4] = BIN2BCD(time->Week);
	temp[5] = BIN2BCD(time->Month);
	temp[6] = BIN2BCD(time->Year);

	return (IIC_ERR_OK == PCF8523_WriteData(IIC_RTC, PCF8523_Reg_Sec, temp, sizeof(temp))) ? true : false;
}


/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Reset
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :复位时钟芯片
 * *
 * *****************************************************************************/
bool PCF8523_Reset(void)
{
	uint8_t temp = 0x58;
	return (true == PCF8523_WriteData(IIC_RTC, PCF8523_Reg_Ctl_1, &temp, 1)) ? true : false;
}

/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_Ctl_1
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :写ctrl 1 寄存器
 * *
 * *****************************************************************************/
bool PCF8523_Set_Ctl_1(void)
{
	return (true == PCF8523_WriteData(IIC_RTC, PCF8523_Reg_Ctl_1, &PCF8523_Reg.Ctl_1, 1)) ? true : false;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_Ctl_2
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :写ctrl 2 寄存器
 * *
 * *****************************************************************************/
bool PCF8523_Set_Ctl_2(void)
{
	return (true == PCF8523_WriteData(IIC_RTC, PCF8523_Reg_Ctl_2, &PCF8523_Reg.Ctl_2, 1)) ? true : false;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_Ctl_3
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :写ctrl 3 寄存器
 * *
 * *****************************************************************************/
bool PCF8523_Set_Ctl_3(void)
{
	PCF8523_Reg.Ctl_3 &= ~(0x111 << 5);
	return (true == PCF8523_WriteData(IIC_RTC, PCF8523_Reg_Ctl_3, &PCF8523_Reg.Ctl_3, 1)) ? true : false;
}

/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Read_Ctl_1
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :读ctrl 1 寄存器
 * *
 * *****************************************************************************/
bool PCF8523_Read_Ctl_1(void)
{
	return (true == PCF8523_ReadData(IIC_RTC, PCF8523_Reg_Ctl_1, &PCF8523_Reg.Ctl_1, 1)) ? true : false;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Read_Ctl_2
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :读ctrl 2 寄存器
 * *
 * *****************************************************************************/
bool PCF8523_Read_Ctl_2(void)
{
	return (true == PCF8523_ReadData(IIC_RTC, PCF8523_Reg_Ctl_2, &PCF8523_Reg.Ctl_2, 1)) ? true : false;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Read_Ctl_3
 * *     >参    数  :void
 * *     >返 回 值  :bool
 * *     >描    述  :读ctrl 3 寄存器
 * *
 * *****************************************************************************/
bool PCF8523_Read_Ctl_3(void)
{
	return (true == PCF8523_ReadData(IIC_RTC, PCF8523_Reg_Ctl_3, &PCF8523_Reg.Ctl_3, 1)) ? true : false;
}

/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_Cap
 * *     >参    数  :电容大小
 * *     >返 回 值  :void
 * *     >描    述  :设置内部震荡电容
 * *
 * *****************************************************************************/
void PCF8523_Set_Cap(tPCF8523_CAP cap)
{
    PCF8523_Reg.Ctl_1 &= ~(1 << 7);
    PCF8523_Reg.Ctl_1 |= cap << 7;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_HourMode
 * *     >参    数  :时间模式
 * *     >返 回 值  :void
 * *     >描    述  :设置时间模式为12H或者24H
 * *
 * *****************************************************************************/
void PCF8523_Set_HourMode(tPCF8523_HourMode mode)
{
    PCF8523_Reg.Ctl_1 &= ~(1 << 3);
    PCF8523_Reg.Ctl_1 |= mode << 3;
}

/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_SIE
 * *     >参    数  :使能配置
 * *     >返 回 值  :void
 * *     >描    述  :配置秒中断使能
 * *
 * *****************************************************************************/
void PCF8523_Set_SIE(tPCF8523_SIE sie)
{
    PCF8523_Reg.Ctl_1 &= ~(1 << 2);
    PCF8523_Reg.Ctl_1 |= sie << 2;
}

/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_AIE
 * *     >参    数  :使能配置
 * *     >返 回 值  :void
 * *     >描    述  :配置alarm中断使能
 * *
 * *****************************************************************************/
void PCF8523_Set_AIE(tPCF8523_AIE aie)
{
    PCF8523_Reg.Ctl_1 &= ~(1 << 1);
    PCF8523_Reg.Ctl_1 |= aie << 1;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_CIE
 * *     >参    数  :使能配置
 * *     >返 回 值  :void
 * *     >描    述  :配置修正中断使能
 * *
 * *****************************************************************************/
void PCF8523_Set_CIE(tPCF8523_CIE cie)
{
    PCF8523_Reg.Ctl_1 &= ~(1 << 0);
    PCF8523_Reg.Ctl_1 |= cie << 0;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_WTAIE
 * *     >参    数  :使能配置
 * *     >返 回 值  :void
 * *     >描    述  :配置watchdog timer A中断使能
 * *
 * *****************************************************************************/
void PCF8523_Set_WTAIE(tPCF8523_WTAIE wtaie)
{
    PCF8523_Reg.Ctl_2 &= ~(1 << 2);
    PCF8523_Reg.Ctl_2 |= wtaie << 2;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_CTAIE
 * *     >参    数  :使能配置
 * *     >返 回 值  :void
 * *     >描    述  :配置countdown timer A中断使能
 * *
 * *****************************************************************************/
void PCF8523_Set_CTAIE(tPCF8523_CTAIE ctaie)
{
    PCF8523_Reg.Ctl_2 &= ~(1 << 1);
    PCF8523_Reg.Ctl_2 |= ctaie << 1;
}
/******************************************************************************
 * *
 * *     >编 辑 者  :LJK
 * *     >创建时间  :2024-2-20
 * *     >更 新 者  :
 * *     >更新时间  :
 * *     >函数名称  :PCF8523_Set_CTBIE
 * *     >参    数  :使能配置
 * *     >返 回 值  :void
 * *     >描    述  :配置countdown timer B中断使能
 * *
 * *****************************************************************************/
void PCF8523_Set_CTBIE(tPCF8523_CTBIE ctbie)
{
    PCF8523_Reg.Ctl_2 &= ~(1 << 0);
    PCF8523_Reg.Ctl_2 |= ctbie << 0;
}


